# CurveLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveLevel Property
ParameterTypeId Class See Also
---
"Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace